// coding: Cp866 -> koi-8r -> Cp1251
/*  *****************************************************
    *         ╧ЁюуЁрььр яюёЄЁюхэш  уЁрЇшъют             *
    *      ъЁштющ Ёрчуюэр яхЁхїюфэ√ї яЁюЎхёёют          *
    *   ш фы  шчєўхэш  чрьъэєЄюую ъюэЄєЁр ЁхуєышЁютрэш  *
    *   ( эряЁшьхЁ ъюэЄєЁ ё яэхтьрЄшъющ )               *
    *   шёяюы№чєхЄё  DOS-ютёър  уЁрЇшър egavga.bgi      *
    *+-------------------------------------------------+*
    *| ╨рчЁрсюЄры ёЄєфхэЄ 4-ую ъєЁёр уЁєяя√            |*
    *|    └-903 ╥рЁрёют ╤хЁухщ                         |*
    *|       ъ ъєЁёютющ ЁрсюЄх яю ╠╬╤╙ эр чшьэ■■ ёхёёш■|*
    *+-------------------------------------------------+*
    *****************************************************/

#include "zsr_dos.h"

// todo ╤фхырЄ№ сюы№°х ъюььхэЄрЁшхт
void  main(void){
    char* file_name = "zsr_asu.dat";
    paa->read_dat();
    do{
        paa->coeff_a();
        paa->tab_dat();
        switch(pp){
            case 'a':
            paa->rasgon();
            case 'b':
            paa->per();
            break;
            case 'c':
            paa->opros_p();
            break;
        }
    }while(pp != 'x');
    paa->record_dat();
}
