# Codepage Cp866 -> koi-8r -> Cp1251
/*  Аппроксимация по формуле полинома
    программа Тарасова Сергея
    Лабораторная работа 1
    по МОСУ                             */

/*  Постановка задачи:
----------------------------------------------
Имеется объект, обладающей определённой статической
характеристикой, которая считается устойчивой на
протяжении всего времени. Астатизм объекта пренебрежимо мал,
либо он на нашем эксперименте не отражается.
В ходе эксперимента была снята таблица отклика объекта
от входного воздействия. Известно, что статическая
характеристика объекта описывается функцией в виде
y=f(x) полинома степени "m".
Необходимо найти коэффициенты и степень полинома так,
чтобы статическая характеристика имела достаточно
точное соответствие реальной зависимости.
*/

# include <conio.h>
# include <stdio.h>
# include <math.h>
# include "aaprox.h"

// todo Сделать больше комментариев

void main(void){
    char pp = 'g';
    int m, // Степень полинома
	kpi, l,
	number, // Число экспериментальных точек
	i, ip1, j, n, k, f1, f2;
    float temp, factor, sum, fk, f,
	  x[120], y[120], yr[120], a[11][11], b[11], c[11], p[25],
	  sost, sv, sr, teta,
	  r, sxy, sx, sy, sx2, sy2;
	
    clrscr();
    while(1){
		vvod();
		raschet();
    }
}
